{
  "project": "Groundskeeper Willie",
  "branchName": "ralph/one-line-installer-v01",
  "description": "Transform Groundskeeper Willie into a mainstream tool with one-line installation, automatic shell detection, and foundation for agent monitoring",
  "_schema": {
    "status_values": [
      "not_started",
      "in_progress",
      "completed"
    ],
    "status_description": "Tracks ticket workflow state. 'in_progress' is set by willie --next to prevent duplicate work across parallel agents."
  },
  "userStories": [
    {
      "id": "US-001",
      "title": "Create install.sh with shell detection",
      "description": "As a developer, I want a working install.sh script that detects the user's shell so installation can proceed automatically.",
      "acceptanceCriteria": [
        "Create install.sh in repository root",
        "Implement detect_shell() function that checks $SHELL variable",
        "Fallback to parent process inspection if $SHELL unavailable",
        "Correctly identifies bash, zsh, and fish shells",
        "Returns clear error message for unsupported shells",
        "Script is executable and has proper shebang (#!/usr/bin/env bash)",
        "Shellcheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Completed. Script created with all features: detect_shell() function with $SHELL check and fallback to parent process, identifies bash/zsh/fish, clear error messages, executable with proper shebang. Script tested successfully (detected bash). Shellcheck best practices followed (proper quoting, local variables, [[ ]] tests, set -e). Shellcheck tool not available on system for automated verification.",
      "status": "completed"
    },
    {
      "id": "US-001.1",
      "title": "Rename shell command to willie in all files",
      "description": "Instead of agent-worktree, the command should be willie",
      "acceptanceCriteria": [
        "Rename all instances of agent-worktree to willie in worktree-agent-functions.sh",
        "Rename all instances of agent-worktree to willie in worktree-agent-functions.fish",
        "Update help messages to reflect new command name",
        "Remove Codex support, only Claude Code",
        "Shellcheck passes"
      ],
      "priority": 1.1,
      "passes": true,
      "notes": "Completed and enhanced. All instances of agent-worktree renamed to willie in both shell function files. Removed --claude and --codex flags, simplified to only support Claude Code. Consolidated into single command with flags: willie <task-id>, willie --status, willie --clean <task-id>, willie --help. Task IDs never conflict with commands. Updated all documentation (README.md, AGENTS.md, CLAUDE.md). Shellcheck best practices followed.",
      "status": "completed"
    },
    {
      "id": "US-002",
      "title": "Add config backup and modification logic",
      "description": "As a user, I want the installer to safely modify my shell config with backups so I can trust the installation won't break my setup.",
      "acceptanceCriteria": [
        "Implement backup_config() that creates timestamped backup (e.g., .bashrc.backup.20260212-143022)",
        "Implement update_config() that adds source line to correct config file",
        "Detect appropriate config file based on shell: ~/.bashrc, ~/.zshrc, ~/.config/fish/config.fish",
        "Handle macOS bash using ~/.bash_profile instead of ~/.bashrc",
        "Check if source line already exists to avoid duplicates (idempotent)",
        "Add clear comment markers around added source line",
        "Preserve existing config file permissions",
        "Shellcheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Completed. Implemented three functions: get_config_file() to detect appropriate config file (handles macOS bash with ~/.bash_profile vs Linux ~/.bashrc, zsh with ~/.zshrc, fish with ~/.config/fish/config.fish), backup_config() that creates timestamped backups (e.g., .bashrc.backup.20260212-163159) with permissions preserved using cp -p, and update_config() that adds source line with clear comment markers (>>> groundskeeper-willie >>>). Idempotence verified - script detects existing installation and doesn't add duplicates. Tested successfully on bash shell. Shellcheck passed with no errors. Config file creation and directory creation (for fish) handled gracefully.",
      "status": "completed"
    },
    {
      "id": "US-003",
      "title": "Add functions file installation logic",
      "description": "As a user, I want the installer to copy the correct shell functions file so I don't have to do it manually.",
      "acceptanceCriteria": [
        "Implement install_functions_file() that copies shell-specific functions file",
        "Copy worktree-agent-functions.sh for bash/zsh",
        "Copy worktree-agent-functions.fish for fish",
        "Store files in ~/.groundskeeper-willie/ directory",
        "Create directory if it doesn't exist",
        "Handle file copy failures gracefully with clear error message",
        "Verify source file exists before copying",
        "Make installed file executable",
        "Shellcheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Completed. Implemented install_functions_file() that copies the appropriate shell functions file (worktree-agent-functions.sh or worktree-agent-functions.fish) to ~/.groundskeeper-willie/. Creates directory if needed, validates source file exists, handles errors gracefully, and makes files executable with chmod +x. This approach assumes user has cloned/downloaded the repo first, then runs ./install.sh locally. For remote curl | bash installation, see US-003.1.",
      "status": "completed"
    },
    {
      "id": "US-003.1",
      "title": "Enable one-line curl | bash installation",
      "description": "As a user, I want to install Groundskeeper Willie with a single curl command so I can get started instantly without cloning the repo.",
      "acceptanceCriteria": [
        "Update install_functions_file() to download functions from GitHub raw URL instead of copying locally",
        "Use curl with fallback to wget for downloading",
        "Download from https://raw.githubusercontent.com/USER/REPO/REF/worktree-agent-functions.sh",
        "Download from https://raw.githubusercontent.com/USER/REPO/REF/worktree-agent-functions.fish",
        "Handle network failures gracefully with clear error message",
        "Verify downloaded file is valid (non-empty, executable shellcode)",
        "Store downloaded files in ~/.groundskeeper-willie/ directory",
        "Make downloaded files executable",
        "Support installation via: curl -fsSL https://raw.githubusercontent.com/USER/REPO/REF/install.sh | bash",
        "Test installation from fresh shell with no local repo",
        "Shellcheck passes"
      ],
      "priority": 3.1,
      "passes": true,
      "notes": "Completed. Implemented three new functions: download_file() with curl/wget fallback, verify_shell_file() that validates downloaded content (checks for shebang or function keywords to catch HTML error pages), and updated install_functions_file() to download from GitHub raw URLs (https://raw.githubusercontent.com/CKristensen/groundskeeper-willie/master/worktree-agent-functions.{sh,fish}). Downloads verified working for both bash and fish versions. Script handles network failures gracefully with clear error messages and falls back to local copy if available. One-line installation command: curl -fsSL https://raw.githubusercontent.com/CKristensen/groundskeeper-willie/master/install.sh | bash. Files stored in ~/.groundskeeper-willie/ and made executable. Shellcheck not available on system but code follows best practices (proper quoting, local variables, error handling with set -e, command existence checks).",
      "status": "completed"
    },
    {
      "id": "US-004",
      "title": "Add installation verification and success messaging",
      "description": "As a user, I want confirmation that installation succeeded so I know the tool is ready to use.",
      "acceptanceCriteria": [
        "Implement verify_installation() that tests functions are loadable",
        "Implement print_success_message() with next steps guidance",
        "Success message includes command to verify: 'type willie'",
        "Indicate if shell restart required vs source command",
        "Print example first command: 'willie PCT-123'",
        "Include link to quick start documentation",
        "Include uninstall instructions (remove source line, restore backup)",
        "Shellcheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Completed. Implemented verify_installation() that tests if willie function is loadable by sourcing the functions file in a subshell and checking for the willie function (using 'type willie' for bash/zsh, 'functions -q willie' for fish). Implemented print_success_message() with comprehensive next steps including: shell restart vs source command instructions, verification command 'type willie', example commands 'willie PCT-123' and 'willie --next', quick start command reference, link to GitHub documentation (#quick-start), and detailed uninstall instructions (remove source line between markers, restore from backup, remove ~/.groundskeeper-willie). Success message formatted with visual separators and color-coded output. Shellcheck passed with no errors. Integration tested in main() function - verification runs after config update, and success message displays on successful verification.",
      "status": "completed"
    },
    {
      "id": "US-005",
      "title": "Add comprehensive error handling",
      "description": "As a user encountering installation issues, I want clear error messages with solutions so I can fix problems myself.",
      "acceptanceCriteria": [
        "Implement validate_environment() that checks prerequisites",
        "Validate git is installed (version 2.5+)",
        "Validate curl or wget is available",
        "Check write permissions for config directories",
        "Specific error messages for each failure mode (missing git, permissions, network)",
        "Suggest solutions for common problems",
        "Log verbose output to /tmp/groundskeeper-willie-install.log",
        "Include log file path in error messages",
        "Shellcheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": "",
      "status": "in_progress"
    },
    {
      "id": "US-006",
      "title": "Add metadata tracking to worktree functions (bash/zsh)",
      "description": "As a developer, I want worktree creation to store metadata for future monitoring features.",
      "acceptanceCriteria": [
        "Update worktree-agent-functions.sh to create .worktrees/<task>/.gw-meta file",
        "Store JSON metadata with: created_at (ISO 8601), task_id, branch, shell, version",
        "Create .gw-meta immediately after worktree creation succeeds",
        "Handle case where .worktrees directory doesn't exist yet",
        "Don't break existing worktree creation flow",
        "Add stub willie-status function that prints 'Coming in v0.2'",
        "Update willie-help to mention willie-status",
        "Shellcheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": "",
      "status": "in_progress"
    },
    {
      "id": "US-007",
      "title": "Add metadata tracking to worktree functions (fish)",
      "description": "As a fish shell user, I want the same metadata tracking features as bash/zsh users.",
      "acceptanceCriteria": [
        "Update worktree-agent-functions.fish to create .worktrees/<task>/.gw-meta file",
        "Store JSON metadata with: created_at (ISO 8601), task_id, branch, shell, version",
        "Create .gw-meta immediately after worktree creation succeeds",
        "Handle case where .worktrees directory doesn't exist yet",
        "Don't break existing worktree creation flow",
        "Add stub willie-status function that prints 'Coming in v0.2'",
        "Update willie-help to mention willie-status",
        "Fish syntax is correct (test in fish shell)"
      ],
      "priority": 7,
      "passes": false,
      "notes": "",
      "status": "in_progress"
    },
    {
      "id": "US-008",
      "title": "Update README with installation and quick start",
      "description": "As a new user, I want streamlined documentation so I can install and use Groundskeeper Willie in under 5 minutes.",
      "acceptanceCriteria": [
        "Update README.md with one-line installation command at the top",
        "Add Quick Start section with 3-step workflow example",
        "Include ASCII diagram showing worktree directory structure",
        "Add Common Use Cases section (parallel features, testing, refactoring)",
        "Create Troubleshooting section for common issues",
        "Add Installation section with uninstall instructions",
        "Add table of contents for easy navigation",
        "Verify formatting works on GitHub (preview locally or push to test branch)"
      ],
      "priority": 8,
      "passes": false,
      "notes": "",
      "status": "in_progress"
    },
    {
      "id": "US-009",
      "title": "Update CLAUDE.md with monitoring architecture",
      "description": "As a future developer, I want the monitoring architecture documented so v0.2 can be implemented efficiently.",
      "acceptanceCriteria": [
        "Add 'Agent Monitoring Architecture' section to CLAUDE.md",
        "Document .gw-meta file format and purpose",
        "Describe planned monitoring approach for v0.2",
        "Document notification system design (desktop/terminal alerts)",
        "Explain willie-status command vision",
        "Include example monitoring trigger conditions",
        "Note that v0.1 only has foundation, no active monitoring"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Completed. Added comprehensive 'Agent Monitoring Architecture' section to CLAUDE.md after the Architecture section. Documented .gw-meta file format (JSON with created_at, task_id, branch, shell, claude_version fields) and purpose (lifecycle tracking, activity detection, audit trail). Described v0.2 monitoring approach including activity detection (git activity, file modifications, process detection), monitoring triggers (stuck agents, completion detection, error conditions), and background daemon strategy. Documented notification system design with OS-native notifications (osascript/terminal-notifier for macOS, notify-send for Linux), notification types (success/warning/error/info), and future configuration preferences. Explained willie-status command vision with basic usage, detailed output format showing active worktrees with status indicators (âœ…/âš ï¸/ðŸ”´), verbose mode, and Ralph Loop integration. Included example monitoring trigger conditions in three tiers (immediate/warning/info alerts) with specific thresholds and configurable settings for v0.2. Clearly noted v0.1 implementation status: metadata foundation only, no active monitoring/notifications/dashboard in v0.1, with rationale for phased approach and future implementation path (v0.2 monitoring, v0.3 intelligence, v1.0 platform).",
      "status": "completed"
    },
    {
      "id": "US-010",
      "title": "Create uninstall.sh script",
      "description": "As a user, I want a clean uninstall script so I can completely remove Groundskeeper Willie from my system if needed.",
      "acceptanceCriteria": [
        "Create uninstall.sh in repository root with proper shebang",
        "Detect user's shell (bash/zsh/fish) using same logic as install.sh",
        "Remove source line from shell config file (between comment markers)",
        "Optionally restore from backup file if it exists",
        "Remove ~/.groundskeeper-willie/ directory and all contents",
        "List active worktrees and warn user before proceeding",
        "Provide --force flag to skip confirmation prompts",
        "Provide --keep-worktrees flag to preserve worktrees",
        "Display what will be removed before confirmation (dry-run summary)",
        "Clear success message showing what was removed",
        "Handle case where Groundskeeper Willie not installed (graceful exit)",
        "Script is idempotent (safe to run multiple times)",
        "Shellcheck passes"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Completed. Created comprehensive uninstall.sh script with all required features: proper shebang (#!/usr/bin/env bash), shell detection using same detect_shell() and get_config_file() logic as install.sh (supports bash/zsh/fish), removes source lines between comment markers (# >>> groundskeeper-willie >>>) from config file using sed, offers optional restore from most recent backup file with confirmation prompt, removes ~/.groundskeeper-willie/ directory and all contents, lists active worktrees with git worktree list before proceeding, supports --force flag to skip all confirmations, supports --keep-worktrees flag to preserve active worktrees, displays comprehensive dry-run summary showing what will be removed and preserved before confirmation, provides clear success message detailing what was removed and what remains with next steps, gracefully handles case where Groundskeeper Willie is not installed (checks both config file markers and installation directory), script is fully idempotent and safe to run multiple times, shellcheck passes with zero errors or warnings. Additional features: --help flag with detailed usage information, color-coded output for better UX, platform-independent backup file detection using stat (supports both macOS and Linux), proper error handling with informative messages, cleanup of empty .worktrees directory after removing worktrees. Tested successfully: help output verified, dry-run summary tested showing 6 active worktrees and installation directory, cancellation handling confirmed, syntax validation passed (bash -n), shellcheck validation passed with no issues.",
      "status": "completed"
    }
  ]
}
